Revit 2027 API
MultiReferenceAnnotationType.GetAllowedTagCategory Method
 Returns the category ID for the tag types which can be used by this multi-reference annotation type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetAllowedTagCategory()
Public Function GetAllowedTagCategory As ElementId
public:
ElementId^ GetAllowedTagCategory()
member GetAllowedTagCategory : unit -> ElementId
Return Value
ElementId
 The allowed tag category ID.
Remarks
 The allowed tag category is determined by the reference category of this multi-reference annotation type.
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace